---
type: Speckle
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 8
tags: [revit-api, class]
---

# Speckle

`Autodesk.Revit.DB.Visual.Speckle` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | SpeckleColor1 | 2018.1 | `public static string SpeckleColor1 { get ; }` |
| Property | SpeckleColor2 | 2018.1 | `public static string SpeckleColor2 { get ; }` |
| Property | SpeckleSize | 2018.1 | `public static string SpeckleSize { get ; }` |
| Property | TextureAngle | 2018.1 | `public static string TextureAngle { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldOffsetZ | 2018.1 | `public static string TextureRealWorldOffsetZ { get ; }` |